
<?php

// $year=2020;
// $h=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
// $b=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
// for($i=0;$i<9;$i++){
//     for($j=0;$j<11;$j++){
//         echo $h[$i] .$b[$j] ."<br>" ;
//         }
//         }

$year=2030;
$h=["甲","乙","丙","丁","戊","己","庚","辛","壬","癸"];
$b=["子","丑","寅","卯","辰","巳","午","未","申","酉","戌","亥"];
$arr=[];
for($i=1024;$i<2084;$i++){
    // $arr[]=$i;
    $arr[$i]=$h[($i%10+6)%10] .$b[($i%12+8)%12];
}
echo "<pre>";print_r($arr);echo "</pre>";

echo $year .'是'. $arr[$year] .'年' ;

?>

<hr>



