<?php
$score=[
    "01"=>[
    "國文"=>88,
    "英文"=>87,
    "數學"=>86,
],
    "21"=>[
    "國文"=>78,
    "英文"=>77,
    "數學"=>76,
],
    "31"=>[
    "國文"=>68,
    "英文"=>66,
    "數學"=>65,
],
    "41"=>[
    "國文"=>98,
    "英文"=>97,
    "數學"=>96,
],
    "06"=>[
    "國文"=>51,
    "英文"=>55,
    "數學"=>57,
],
    "09"=>[
    "國文"=>43,
    "英文"=>48,
    "數學"=>47,
],

];


if(isset($_GET['num'])){
    $num=$_GET['num'];
    echo "座號" .$num ."的成績:<br>";
    echo "國文成績".$score[$num]["國文"]."分" ."<br>";
    echo "英文成績".$score[$num]["英文"]."分" ."<br>";
    echo "數學成績".$score[$num]["數學"]."分" ."<br>";
}else{
    echo "<span style='font-weight:border:color:red'>!!座號</span>";
}



?>